# Informações de um DataFrame

In [1]:
import pandas as pd
data = [['Fulano', 12, 7.0, True],
        ['Sicrano', 15, 3.5, False], 
        ['Beltrano', 18, 9.3, True]]
dados = pd.DataFrame(data, 
        columns = ['Aluno', 'Idade', 'Nota', 'Aprovado'])
dados

      Aluno  Idade  Nota  Aprovado
0    Fulano     12   7.0      True
1   Sicrano     15   3.5     False
2  Beltrano     18   9.3      True

In [2]:
dados.dtypes

Aluno        object
Idade         int64
Nota        float64
Aprovado       bool
dtype: object

In [3]:
tipos_de_dados = pd.DataFrame(dados.dtypes, columns = ['Tipo de Dados'])

In [4]:
tipos_de_dados.columns.name = 'Variáveis'

In [5]:
tipos_de_dados

Variáveis Tipo de Dados
Aluno            object
Idade             int64
Nota            float64
Aprovado           bool